cases/rain/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     aerosolEulerFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          0.01;

writeControl    adjustableRunTime;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1;

libs            ("libcustomFunctions.so");

functions
{
    dcm
    {
        type            countMeanDiameter;
        libs            ("libaerosolModels.so");
        writeControl    writeTime;
    }

    numberFlux
    {
        type            sectionalFlux;
        libs            ("libaerosolModels.so");
        writeControl    writeTime;

        patches
        (
            bottom
            top
        );
    }

    massFlux
    {
        type            massFlux;
        libs            ("libaerosolModels.so");
        writeControl    writeTime;

        patches
        (
            bottom
            top
        );
    }

    Pe
    {
        type            sectionalPecletNumbers;
        libs            ("libaerosolModels.so");
        writeControl    writeTime;
    }

    meanPe
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");

        regionType      patch;
        name            bottom;

        operation       areaAverage;

        fields
        (
            Pe.01
            Pe.02
            Pe.03
            Pe.04
            Pe.05
            Pe.06
            Pe.07
            Pe.08
            Pe.09
            Pe.10
        );

        writeFields     no;
        log             no;
    }
}
