cases/rain/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 0.01;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 16 1) simpleGrading (1 1 1)
);

boundary
(
    top
    {
        type    wall;

        faces
        (
            (2 3 7 6)
        );
    }

    bottom
    { 
        type    wall;
        faces
        (
            (0 1 5 4)
        );
    }

    empties
    {
        type empty;

        faces
        (
            (0 4 7 3)
            (1 2 5 6)
            (0 1 2 3)
            (7 6 5 4)
        );
    }
);

mergePatchPairs
(
);
