cases/rain/0.org/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0 0);

boundaryField
{
    bottom
    {
        type        noSlipInert;
        value       $internalField;
    }
    
    top
    {
        type        zeroGradient;
    }

    empties
    {
        type        empty;
    }
}
