cases/rain/0.org/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1E5;

boundaryField
{
    bottom
    {
        type        zeroGradient;
    }

    top
    {
        type        fixedValue;
        value       $internalField;
    }
    
    empties
    {
        type        empty;
    }
}
