cases/rain/0.org/M
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      M;
}

dimensions      [-1 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    bottom
    {
        type        sectionalMixedAbsorbing;
        value       $internalField;
    }

    top
    {
        type        sectionalConstant;
        value       $internalField;
    }
    
    empties
    {
        type        empty;
    }
}
