cases/rain/0.org/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    bottom
    {
        type        zeroGradient;
    }
    
    top
    {
        type        fixedValue;
        value       $internalField;
    }

    empties
    {
        type        empty;
    }
}
