cases/rain/0.org/Water.dispersed
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Water.dispersed;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    bottom
    {
        type        massFracFromSectional;
        value       $internalField;
    }
   
    top
    {
        type        fixedValue;
        value       uniform 1e-3;
    }

    empties
    {
        type        empty;
    }
}
